## where to install homebrew-cask applications
## brew bundle dump
cask_args appdir: '/Applications'

tap "homebrew/core"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "johanhaleby/kubetail"
tap "hidetatz/tap"
tap "weaveworks/tap"

brew "azure-cli"
brew "asciinema"
brew "bash-completion"
brew "bat"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git"
brew "github-keygen"
brew "gnupg"
brew "go-task"
brew "go"
brew "hashicorp/tap/terraform"
brew "helm"
brew "htop"
brew "iproute2mac"
brew "jq"
brew "k9s"
brew "kubectx"
brew "johanhaleby/kubetail/kubetail"
brew "hidetatz/tap/kubecolor"
brew "mas"
brew "most"
brew "neovim"
brew "nmap"
brew "pass"
brew "python@3.11", link: false
brew "shellcheck"
brew "shfmt"
brew "skopeo"
brew "stern"
brew "tree"
brew "weaveworks/tap/eksctl"
brew "wget"
brew "yq"
cask "docker"
cask "foxitreader"
cask "google-chrome"
cask "hashicorp-vagrant"
cask "postman"
cask "visual-studio-code"
